Revit 2024 API
SATExportOptions Class
 The export options used by exporting SAT format file. So far, there is no option in it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class SATExportOptions : IDisposable
Visual Basic
Public Class SATExportOptions _
	Implements IDisposable
Visual C++
public ref class SATExportOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SATExportOptions
See Also
SATExportOptions Members
Autodesk.Revit.DB Namespace